public class Main {
    public static void main(String[] args) {

        int cost = 10000;
        int miles = cost / 20;

        System.out.println("Вам начислено " + miles + " бонусных миль");
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }


}
